/// @description Insert description here
// You can write your code in this editor

// Inherit the parent event
event_inherited();

help_sprite = spr_butt_E
///переменная отвечающая за рисование подсказки
drowings = false
///координаты на которых от игрока находится подсказка

help_x = -6
help_y = -70
// розташування зони активації сідання: розмір такий як в колізії лавки,
//але розташована зона нижче на вказану кількість пікселів
zone_y=8
//координати початку анімаціїї, куди ГГ самі прийдуть
x1 =-18;
x2=18;
y1=15;
y2=15;
// в даному випадку не є абсолютною необхідністю (копіпаст з розміщення ГГ перед діалогами)
n1="r";
n2="l";
