/// @description Insert description here
// You can write your code in this editor

// Inherit the parent event
event_inherited();

help_sprite = spr_help
///переменная отвечающая за рисование подсказки
drowings = false
///координаты на которых от игрока находится подсказка

help_x = -10
help_y = -70
// розташування зони активації сідання: розмір такий як в колізії лавки,
//але розташована зона нижче на вказану кількість пікселів
zone_y=20
zone_x=15
//координати початку анімаціїї, куди ГГ самі прийдуть
x1 =7;
x2 =8;
y1=1;

// в даному випадку не є абсолютною необхідністю (копіпаст з розміщення ГГ перед діалогами)

n1="l";
n2="r";

pl=0; // змінна для визначення гравця який активує анімацію